art-share-api/app/controllers/artworks_controller.rb

    def index
        user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id])
         if artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 3], ["updated_at", "2019-08-27 20:04:51.782208"], ["id", 1]]