art-share-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "steenj@gmail.com"], ["updated_at", "2019-08-27 15:48:37.761343"], ["id", 2]]
---
    def update
        user = User.find(params[:id])
         if user.update(user_params)